Tekla Open API Reference for Tekla Structures 2025
ConnectionBase Properties
The ConnectionBase type exposes the following members.
Properties
Name | Description
Code
 The connection code of the executable connection instance. The maximum length is 22 characters.
Identifier
 The identifier of the executable plug-in instance.
Positions
 The positional attributes for a detail or a seam instance; one for a detail, N for a seam.
Primary
 The identifier that was selected as the primary object.
Secondaries
 A list of secondary identifiers of a connection or a seam.
Top
See Also
Reference
ConnectionBase Class
Tekla.Structures.Plugins Namespace